import React from "react";
import { TextField } from "@mui/material";

const UsernameInput = ({ handleChange }) => {
    
  return (
    <TextField name="username" label="Username" onChange={handleChange} />
  );
};

export default UsernameInput;


// RememberMeCheckbox:
// คอมโพเนนต์นี้มีหน้าที่แสดงช่องเลือก "จำฉันไว้" (Remember me) ที่ให้ผู้ใช้เลือกต้องการให้คอมพิวเตอร์จดจำค่าเข้าสู่ระบบหรือไม่ คอมโพเนนต์นี้ใช้ Checkbox จาก Material-UI เพื่อสร้างช่องเลือก โดย RememberMeCheckbox จะรับ Props สองตัวดังนี้:

// rememberMe: ค่า boolean ที่บอกว่าควรเลือก (เลือกแล้ว) หรือไม่เลือก (ยังไม่เลือก) ช่องเลือกนี้
// handleRememberMeChange: ฟังก์ชันที่จัดการกับการเปลี่ยนแปลงของช่องเลือก โดยจะทำการอัปเดตสถานะของ rememberMe ในคอมโพเนนต์หลัก (Login) เมื่อผู้ใช้เลือกหรือยกเลิกเลือกในช่องเลือกนี้
// คอมโพเนนต์ RememberMeCheckbox จะใช้ Props เหล่านี้เพื่อแสดงสถานะปัจจุบันของช่องเลือกและเรียกใช้ฟังก์ชัน handleRememberMeChange เมื่อผู้ใช้ทำการกระทำกับช่องเลือก

// PasswordInput:
// คอมโพเนนต์นี้แสดงช่องกรอกข้อมูลรหัสผ่าน โดยใช้ OutlinedInput, InputAdornment และอื่นๆ จาก Material-UI เพื่อสร้างช่องกรอกข้อมูลรหัสผ่านพร้อมปุ่มเพื่อแสดง/ซ่อนรหัสผ่าน คอมโพเนนต์ PasswordInput จะรับ Prop ตัวเดียวคือ:

// handleChange: ฟังก์ชันที่จัดการกับเหตุการณ์การเปลี่ยนแปลงของช่องกรอกข้อมูลรหัสผ่าน โดยจะอัปเดตค่า value ในคอมโพเนนต์หลัก (Login) เมื่อผู้ใช้ป้อนหรือแก้ไขรหัสผ่านของตน
// UsernameInput:
// คอมโพเนนต์นี้แสดงช่องกรอกข้อมูลชื่อผู้ใช้ โดยใช้ TextField จาก Material-UI เพื่อสร้างช่องกรอกข้อมูลชื่อผู้ใช้ คอมโพเนนต์ UsernameInput จะรับ Prop เดียวคือ:

// handleChange: ฟังก์ชันที่จัดการกับเหตุการณ์การเปลี่ยนแปลงของช่องกรอกข้อมูลชื่อผู้ใช้ โดยจะอัปเดตค่า value ในคอมโพเนนต์หลัก (Login) เมื่อผู้ใช้ป้อนหรือแก้ไขชื่อผู้ใช้ของตน
// สรุปของ Props และวิธีการใช้งานในแต่ละคอมโพเนนต์:

// RememberMeCheckbox:

// rememberMe: ค่า boolean ที่บอกว่าควรเลือกหรือไม่เลือกช่องเลือก "จำฉันไว้"
// handleRememberMeChange: ฟังก์ชันที่จัดการกับเหตุการณ์การเปลี่ยนแปลงของช่องเลือก "จำฉันไว้"
// PasswordInput:

// handleChange: ฟังก์ชันที่จัดการกับเหตุการณ์การเปลี่ยนแปลงของช่องกรอกข้อมูลรหัสผ่าน
// UsernameInput:

// handleChange: ฟังก์ชันที่จัดการกับเหตุการณ์การเปลี่ยนแปลงของช่องกรอกข้อมูลชื่อผู้ใช้
// โดยการแยกคอมโพเนนต์ Login เป็นส่วนย่อยๆ และส่ง Props ไปยังแต่ละคอมโพเนนต์ทำให้โค้ดมีความโมดูลและง่ายต่อการบำรุงรักษา แต่ละคอมโพเนนต์สามารถใช้โฟกัสในฟังก์ชันส่วนของตนเพื่อทำหน้าที่ในส่วนของฟอร์มการเข้าสู่ระบบได้